app/Http/Controllers/UserController.php

    public function alluser()
    {
        return User::all()->load('userTipo');
---
select * from `user_tipo` where `user_tipo`.`user_id` in (1)
select * from `users` where `users`.`deleted_at` is null